docs/diagrams/include_diagram.mmd
flowchart
    subgraph C_0009392701334512935369[src]
    subgraph C_0014176827974556851772[Widgets]
    subgraph C_0010347011073788372111[AdminWidget]
    C_0008309121906808763839[AdminWidget.cpp]
    C_0004140566297497285282[AdminWidget.h]
    end
    subgraph C_0009763794611585888067[UserWidget]
    C_0012950180607479447001[UserWidget.cpp]
    C_0000372268219133550912[UserWidget.h]
    end
    subgraph C_0013767205248218814589[LoginWidget]
    C_0008799684567918779338[loginwidget.h]
    C_0009177402481112612119[loginwidget.cpp]
    end
    end
    subgraph C_0007249139127462911352[requestModule]
    C_0004662975987075955962[RequestManager.h]
    C_0003243005645601454693[ResponseManager.cpp]
    C_0015076305304167085100[ResponseManager.h]
    C_0015680580263724453319[RequestManager.cpp]
    end
    subgraph C_0017470984763561192632[Dialogs]
    C_0001470670052551214060[UpdateUserDialog.h]
    C_0006158485752258116163[BaseDialog.h]
    C_0011846255136749913892[ValidationStrategy.h]
    C_0012440556589828314473[CreateUserDialog.h]
    C_0017300576026206201541[UpdateEmailDialog.h]
    C_0004730930078247147942[UpdatePasswordDialog.h]
    end
    subgraph C_0011121512235108805536[Client]
    C_0000111696680446229526[ClientHandler.cpp]
    C_0009648727152734889675[ClientHandler.h]
    C_0010393880033178359530[tcpclient.h]
    C_0015098463031054547511[tcpclient.cpp]
    end
    subgraph C_0011206568869901917921[AppManager]
    C_0001125553280068348594[AppManager.cpp]
    C_0011700575639516634919[AppManager.h]
    C_0012805618584828466530[UIManager.h]
    C_0016387530051960150143[UIManager.cpp]
    end
    end
    C_0008309121906808763839 --> C_0004140566297497285282
    C_0008309121906808763839 --> C_0001470670052551214060
    C_0008309121906808763839 --> C_0012440556589828314473
    C_0008309121906808763839 --> C_0017300576026206201541
    C_0008309121906808763839 --> C_0004730930078247147942
    C_0004140566297497285282 --> C_0004662975987075955962
    C_0012950180607479447001 --> C_0000372268219133550912
    C_0012950180607479447001 --> C_0017300576026206201541
    C_0012950180607479447001 --> C_0004730930078247147942
    C_0012950180607479447001 --> C_0011846255136749913892
    C_0000372268219133550912 --> C_0004662975987075955962
    C_0008799684567918779338 --> C_0004662975987075955962
    C_0009177402481112612119 --> C_0008799684567918779338
    C_0009177402481112612119 --> C_0004662975987075955962
    C_0003243005645601454693 --> C_0015076305304167085100
    C_0015680580263724453319 --> C_0004662975987075955962
    C_0001470670052551214060 --> C_0006158485752258116163
    C_0006158485752258116163 --> C_0011846255136749913892
    C_0012440556589828314473 --> C_0006158485752258116163
    C_0012440556589828314473 --> C_0011846255136749913892
    C_0017300576026206201541 --> C_0006158485752258116163
    C_0004730930078247147942 --> C_0006158485752258116163
    C_0000111696680446229526 --> C_0009648727152734889675
    C_0009648727152734889675 --> C_0010393880033178359530
    C_0015098463031054547511 --> C_0010393880033178359530
    C_0001125553280068348594 --> C_0011700575639516634919
    C_0011700575639516634919 --> C_0012805618584828466530
    C_0011700575639516634919 --> C_0009648727152734889675
    C_0012805618584828466530 --> C_0008799684567918779338
    C_0012805618584828466530 --> C_0004140566297497285282
    C_0012805618584828466530 --> C_0000372268219133550912
    C_0012805618584828466530 --> C_0004662975987075955962
    C_0012805618584828466530 --> C_0015076305304167085100
    C_0016387530051960150143 --> C_0012805618584828466530

%% Generated with clang-uml, version 0.5.3
%% LLVM version clang version 18.1.1 (https://github.com/llvm/llvm-project.git dba2a75e9c7ef81fe84774ba5eee5e67e01d801a)
