docs/diagrams/include_diagram.puml
@startuml
folder "src" as C_0009392701334512935369 {
folder "Widgets" as C_0014176827974556851772 {
folder "AdminWidget" as C_0010347011073788372111 {
file "AdminWidget.cpp" as C_0008309121906808763839
file "AdminWidget.h" as C_0004140566297497285282
}
folder "UserWidget" as C_0009763794611585888067 {
file "UserWidget.cpp" as C_0012950180607479447001
file "UserWidget.h" as C_0000372268219133550912
}
folder "LoginWidget" as C_0013767205248218814589 {
file "loginwidget.h" as C_0008799684567918779338
file "loginwidget.cpp" as C_0009177402481112612119
}
}
folder "requestModule" as C_0007249139127462911352 {
file "RequestManager.h" as C_0004662975987075955962
file "ResponseManager.cpp" as C_0003243005645601454693
file "ResponseManager.h" as C_0015076305304167085100
file "RequestManager.cpp" as C_0015680580263724453319
}
folder "Dialogs" as C_0017470984763561192632 {
file "UpdateUserDialog.h" as C_0001470670052551214060
file "BaseDialog.h" as C_0006158485752258116163
file "ValidationStrategy.h" as C_0011846255136749913892
file "CreateUserDialog.h" as C_0012440556589828314473
file "UpdateEmailDialog.h" as C_0017300576026206201541
file "UpdatePasswordDialog.h" as C_0004730930078247147942
}
folder "Client" as C_0011121512235108805536 {
file "ClientHandler.cpp" as C_0000111696680446229526
file "ClientHandler.h" as C_0009648727152734889675
file "tcpclient.h" as C_0010393880033178359530
file "tcpclient.cpp" as C_0015098463031054547511
}
folder "AppManager" as C_0011206568869901917921 {
file "AppManager.cpp" as C_0001125553280068348594
file "AppManager.h" as C_0011700575639516634919
file "UIManager.h" as C_0012805618584828466530
file "UIManager.cpp" as C_0016387530051960150143
}
}
C_0008309121906808763839 --> C_0004140566297497285282
C_0008309121906808763839 --> C_0001470670052551214060
C_0008309121906808763839 --> C_0012440556589828314473
C_0008309121906808763839 --> C_0017300576026206201541
C_0008309121906808763839 --> C_0004730930078247147942
C_0004140566297497285282 --> C_0004662975987075955962
C_0012950180607479447001 --> C_0000372268219133550912
C_0012950180607479447001 --> C_0017300576026206201541
C_0012950180607479447001 --> C_0004730930078247147942
C_0012950180607479447001 --> C_0011846255136749913892
C_0000372268219133550912 --> C_0004662975987075955962
C_0008799684567918779338 --> C_0004662975987075955962
C_0009177402481112612119 --> C_0008799684567918779338
C_0009177402481112612119 --> C_0004662975987075955962
C_0003243005645601454693 --> C_0015076305304167085100
C_0015680580263724453319 --> C_0004662975987075955962
C_0001470670052551214060 --> C_0006158485752258116163
C_0006158485752258116163 --> C_0011846255136749913892
C_0012440556589828314473 --> C_0006158485752258116163
C_0012440556589828314473 --> C_0011846255136749913892
C_0017300576026206201541 --> C_0006158485752258116163
C_0004730930078247147942 --> C_0006158485752258116163
C_0000111696680446229526 --> C_0009648727152734889675
C_0009648727152734889675 --> C_0010393880033178359530
C_0015098463031054547511 --> C_0010393880033178359530
C_0001125553280068348594 --> C_0011700575639516634919
C_0011700575639516634919 --> C_0012805618584828466530
C_0011700575639516634919 --> C_0009648727152734889675
C_0012805618584828466530 --> C_0008799684567918779338
C_0012805618584828466530 --> C_0004140566297497285282
C_0012805618584828466530 --> C_0000372268219133550912
C_0012805618584828466530 --> C_0004662975987075955962
C_0012805618584828466530 --> C_0015076305304167085100
C_0016387530051960150143 --> C_0012805618584828466530

'Generated with clang-uml, version 0.5.3
'LLVM version clang version 18.1.1 (https://github.com/llvm/llvm-project.git dba2a75e9c7ef81fe84774ba5eee5e67e01d801a)
@enduml
